# Вправа 1: Проста математика
print("\n=== ВПРАВА 1: Калькулятор ===")
print("Створіть простий калькулятор для двох чисел і двох дій")
print("Підтримувані операції: +, -")

# Початок реалізації:
'''
num1 = float(input("Введіть перше число: "))
operation = input("Введіть операцію (+, -, ): ")
num2 = float(input("Введіть друге число: "))
'''

# float(input("Введіть перше число: ")) термінал видає помилку якщо введено не число і завершує роботу
num1 = input("Введіть перше число: ").replace(",", ".")

if num1.replace(".", "", 1).replace("-", "", 1).isdigit() and num1 != "." and num1 != "-":
    num1 = float(num1)
    operation = input("Введіть операцію (+, -, ): ")
    if operation == "+" or operation == "-":
        # float(input("Введіть друге число: ")) термінал видає помилку якщо введено не число і завершує роботу
        num2 = input("Введіть друге число: ").replace(",", ".")
        if num2.replace(".", "", 1).replace("-", "", 1).isdigit() and num2 != "." and num2 != "-":
            num2 = float(num2)
            if operation == "+":
                print("Результат:", num1 + num2)
            else:
                print("Результат:", num1 - num2)
        else:
            print("Помилка: потрібно ввести число!")
    else:
        print("Помилка: потрібно ввести + або -!")
else:
    print("Помилка: потрібно ввести число!")


# Вправа 2: Перевірка паролю
print("\n=== ВПРАВА 2: Перевірка паролю ===")
print("Створіть систему перевірки паролю")
print("Пароль повинен містити принаймні 8 символів")

password = input("Введіть пароль: ")
if len(password) >= 8:
    print("Вірно. Пароль містить принаймні 8 символів.")
else:
    print("Пароль повинен містити принаймні 8 символів.")


# Вправа 3: Визначення високосного року
print("\n=== ВПРАВА 3: Високосний рік ===")
print("Рік є високосним, якщо:")
print("- Ділиться на 4 І не ділиться на 100")
print("- АБО ділиться на 400")

year = int(input("Введіть рік: "))
if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
    print("Рік високосний.")
else:
    print("Рік не високосний.")


# Вправа 4: Лічильник голосних
print("\n=== ВПРАВА 4: Лічильник голосних ===")
print("Підрахуйте кількість голосних у рядку")

text = input("Введіть текст: ").lower()
vowels = "аеиіїоуюя"
count = 0

# код тут
for letter in text:
    if letter in vowels:
        count += 1
print(f"Кількість голосних: {count}")


# Вправа 5: Гра 
print("\n=== ВПРАВА 5: Гра ===")
"""
Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо колір прибульця green, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця yellow, надрукуйте, що гравець щойно заробив 10 балів.
Якщо колір прибульця red - надрукуйте, що гравець щойно заробив 15 балів.
Перевірте роботу гри самостійно, змінюючи значення alien_color
"""

# alien_color = "green" # Відповідь: Гравець щойно заробив 5 балів.
# alien_color = "yellow" # Відповідь: Гравець щойно заробив 10 балів.
alien_color = "red" # Відповідь: Гравець щойно заробив 15 балів.

if alien_color == "green":
    print("Гравець щойно заробив 5 балів.")
elif alien_color == "yellow":
    print("Гравець щойно заробив 10 балів.")
elif alien_color == "red":
    print("Гравець щойно заробив 15 балів.")


# Вправа 6: Піцерія *
print("\n=== ВПРАВА 6: Начинки для піци (pizza_topping) ===")
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""

topping = ""
while topping != "quit":
    topping = input("Введіть начинку (або 'quit' для завершення): ")
    if topping != "quit":
        print(f"Додаємо {topping} до піци!")


# Вправа 7: Зворотний порядок цифр
print("\n=== ВПРАВА 7: Зворотний порядок ===")
print("Виведіть цифри числа у зворотному порядку")

number = input("Введіть число: ")
reversed_number = number[::-1]  # Разворот строки
print("Число у зворотному порядку:", (reversed_number))


# Вправа 8: Пошук максимального числа
print("\n=== ВПРАВА 8: Пошук максимального ===")
print("Знайдіть найбільше число серед введених")
print("Введіть 0 для завершення")

max_num = None
num = 1
 
while num != 0:
    num = int(input("Введіть число '0' для завершення: "))
    if num != 0:
        if max_num is None or num > max_num:
            max_num = num
 
if max_num is not None:
    print("Найбільше число:", max_num)
else:
    print("Не введено жодного числа.")


# Вправа 9: Виключення зі списку
print("\n=== ВПРАВА 9: Виключення зі списку ===")
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]

for fruit in fruits:
    if fruit == "orange":
        continue
    print(fruit)
# apple
# banana
# grape
# mango 


# Вправа 10: Вираз в один рядок
print("\n=== ВПРАВА 10: Вираз з умовою в один рядок ===")
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
"Відповідь вставте сюди"
result = [x**2 for x in numbers if x % 2 == 0]
print(result)  #  [4, 16, 36, 64, 100]
