import socket  # Імпорт модуля socket для роботи з мережею

# Створення TCP сокета
server = socket.socket(
    socket.AF_INET,  # IPv4
    socket.SOCK_STREAM,  # TCP / надійний протокол для веб-серверів
)

# Прив'язка сервера до IP-адреси та порту
# 127.0.0.1 localhost (поточний комп'ютер)
# 5000 порт на якому сервер буде слухати запити
server.bind(("127.0.0.1", 5000))

# Перехід сокета в режим очікування клієнтів
# Сервер почина чекати нові підключення
server.listen()

print("TCP Echo Server started on port 5000")

# Сервер працює постійно в циклі
while True:
    # Прийм підключення клієнта
    # accept() повертає новий сокет для клієнта та його адресу
    client, address = server.accept()
    print(f"Клієнт підключився: {address}")

    # Отримання повідомлення від клієнта
    # recv() отримує дані з буфера (максимум 1024 байт)
    message = client.recv(1024)
    print(f"Отримано: {message.decode()}")

    # Echo повертаємо клієнту те саме повідомлення
    # send() надсилає дані клієнту
    client.send(message)

    # Закриття з'єднання з цим клієнтом
    # Наступний клієнт зможе підключитися
    client.close()

# Зупинка сервера натиснути Ctrl+C в терміналі
