import socket  # Імпорт модуля socket для роботи з мережею

# Створення TCP сокета клієнта
client = socket.socket(
    socket.AF_INET,  # IPv4 протокол
    socket.SOCK_STREAM,  # TCP / надійний протокол для веб-клієнтів
)

# Підключення до сервера
# 127.0.0.1 localhost (адреса сервера)
# 5000 порт на якому працює сервер
client.connect(("127.0.0.1", 5000))

# Повідомлення для відправки на сервер
msg = "Привіт, сервер"

# Надсилання повідомлення серверу
# encode() перетворює рядок в байти для передачі по мережі
client.send(msg.encode("utf-8"))

# Отримання відповіді від сервера
# recv() отримує дані з буфера (максимум 1024 байт)
response = client.recv(1024)

# decode() перетворює байти назад в рядок
print(f"Отримано від сервера: {response.decode()}")

# Закриття з'єднання з сервером
client.close()

# Результат: сервер повертає те саме повідомлення (echo)
